test/dummy/app/controllers/home_controller.rb

SELECT "arquivos".* FROM "arquivos"
---
	def index
		@arquivos = Arquivo.all

INSERT INTO "arquivos" ("created_at", "file_content_type", "file_file_name", "file_file_size", "file_updated_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?)
---
	def new
		Arquivo.create(:file => params[:Filedata])